*** DOING 评估单周期 NPC 的主频和程序性能
- 首先回退到之前单周期的版本
- 跑 train, 记录周期数
  #+begin_src
    Scored time: 1723693640 ms
    Total  time: 193804.750 ms
    npc: HIT GOOD TRAP at pc = 0x80005608
    host time spent = 193,817,363 us
    total guest instructions = 196,017,664
    simulation frequency = 1,011,352 inst/s
  #+end_src

  由于是单周期处理器，一周期执行一条指令。
  总共的周期数就是 $\text{simulation_frequency} \cdot \text{host_time}$
  也就是 =196,004,821=

  #+begin_src python
    return 1011352 * (193804.750 * 0.001)
  #+end_src

  #+RESULTS:
  : 196004821.522
- 跑 yosys-sta 综合出来的报告看不太懂，之后再说
  - 修改 example 下的 stc 文件，再修改下 Makefile, 然后再 make sta, 就能得到综合结果
    报告在 result/top-500MHz/top.rtp 下
    单周期主频 500Mhz

* 备忘录

书包在会议室
水杯不见了，记得找找 两个会议室，一楼大厅

为什么 axi 总线做的这么慢，感觉是因为懒的画图，所以大部分时间都在空想，很难有实际进展。而又因为很难有进展，导致会出现精神内耗，进而导致发呆，更多的耽误了时间。

Milky duo

What should I do the first time?

避免行为建模

Q: 如何学习一个协议：
- 文档
- 时序图
- 状态转换图
- 电路图
- 源代码，仿真

Q: 如何避免处理器执行了无效指令?

A: 处理器是个状态机!

valid无效时, 只需要不修改处理器的状态即可
状态 = 时序逻辑元件, 将其写使能无效即可

组合逻辑处理器的某些状态会发生跳变，比如读写地址突然跳变成0

XLEN to refer to the **width** of an integer register


在 c 语言中，在 union 里定义的匿名结构体的成员可以被直接访问
#+begin_example
Anonymous structures in C allow us to define structures without naming them, which is particularly useful in nested structures or unions, where naming the inner structure isn’t necessary. They were introduced in the C11 standard, enhancing the language’s flexibility and reducing the need for unnecessary naming.
#+end_example

#+begin_src cpp
    #include <stdio.h>
  typedef struct {
      struct {  // Anonymous struct
	  int x;
	  int y;
      };
      double radius;
  } Circle;
  int main() {
      Circle c;
      c.x = 10;  // Direct access to 'x' and 'y'
      c.y = 20;
      c.radius = 5.0;
      printf("a=%d\n", 0x80000000 / 0xffffffff);
      printf("Circle center: (%d, %d), radius: %.1f\n", c.x, c.y, c.radius);
      return 0;
  }
#+end_src

#+RESULTS:
| a=0                |     |             |
| Circle center: (10 | 20) | radius: 5.0 |

#+begin_src cpp :includes <stdio.h>
  printf("%x %x %x %x\n", -2147475015, -2147445999, -2097152000, -2097131520);
#+end_src

#+RESULTS:
: 800021b9 80009311 83000000 83005000

ramdisk 的地址范围: 800021b9 80009311

记得总结一下在预学习交流会议上遇到的各种问题，好做积累，这样不至于被问到回答不出来。

记得翻译外文文献
要开始写论文了。

没有思路就给代码写逐行注释
遇到一个看不懂的知识点，你的搜索路径是什么？
- 文档
- 课程
- 实践

要有耐心

晚上记得询问，下午去哪里玩了。

`clk to q` means the time it takes for register output to be stable

- 毕业照
- 毕业答辩
- 毕业档案



#+begin_example





  +----------------+   ready	 +------------------+
  |                <-------------+     	       	    |
  |    IFU         |	         |     IDU     	    |
  |                |        	 |             	    |
  |                +------------->             	    |
  +----------------+   valid	 +------------------+












#+end_example
